Tekla Open API Reference for Tekla Structures 2025
LeaderLine.ElbowPoints Property
 The leader line's elbow points (middle points).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PointList ElbowPoints { get; set; }
Public Property ElbowPoints As PointList
	Get
	Set
Property Value
Type: PointList
See Also
Reference
LeaderLine Class
Tekla.Structures.Drawing Namespace